Revit 2027 API
RebarShape.GetRebarShapeDefinition Method
 Return the definition of the RebarShape.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RebarShapeDefinition GetRebarShapeDefinition()
Public Function GetRebarShapeDefinition As RebarShapeDefinition
public:
RebarShapeDefinition^ GetRebarShapeDefinition()
member GetRebarShapeDefinition : unit -> RebarShapeDefinition
Return Value
RebarShapeDefinition
 A copy of the definition. Changes will not affect the RebarShape.
Remarks
 Replaces the property RebarShape.Definition from previous releases.
See Also
Reference
RebarShape Class
Autodesk.Revit.DB.Structure Namespace